app/controllers/barrios_controller.rb

    def set_barrio
      @barrio = Barrio.find(params[:id])
---
SELECT  `barrios`.* FROM `barrios` WHERE `barrios`.`id` = 1 LIMIT 1