app/controllers/ciudades_controller.rb

SELECT id, nombre.capitalize FROM `departamentos`  ORDER BY nombre
---
  def new
    @ciudad = Ciudad.new
    @deptos = Departamento.select("id, nombre").order("nombre")